[{"title": "Sicilian Pizza With Pepperoni and Spicy Tomato Sauce Recipe | Serious Eats", "active_time": "30 minutes", "instructions": [" Combine flour, salt, yeast, 0.35 ounce olive oil, and water in the bowl of a food processor fitted with the blade or dough blade attachment. Process until a dough that rides around the blade forms, then continue processing for 30 seconds. Continue with Step 4 below.", " Combine flour, salt, yeast, and 0.35 ounce olive oil in the bowl of a stand mixer (see below for mixer-free version). Whisk to combine. Fit mixer with dough hook attachment. Add water to mixer and mix on medium speed until dough comes together and no dry flour remains. Increase speed to medium-high and mix until dough is stretchy and smooth, about 6 minutes. The dough should stick to the bottom of bowl, but pull away from the sides. Continue with Step 4 below.", " Combine flour, salt, and yeast in a large bowl. Whisk to combine. Add 0.35 ounce olive oil and water and stir by hand until dough comes together and no dry flour remains. Cover bowl tightly with plastic wrap and let rest at room temperature for 12 to 24 hours. Continue with Step 4 below.", "Pour remaining 1/4 cup olive oil into a 13- by 18-inch rimmed baking sheet and spread over entire inner surface with your hands. Transfer dough to baking sheet and turn in oil until thoroughly coated. Spread gently with your hands. (It will not stretch to fill the pan; this is fine.) Cover baking sheet with plastic wrap and allow to rise at room temperature until dough has slackened and started to spread out toward the edges of the pan, 2 to 3 hours. Carefully remove plastic wrap from pizza dough. Using oiled hands, and working as gently as possible to maintain air bubbles, push and stretch dough into the corners of the pan by pressing out from the center, lifting each corner, and stretching it beyond the edge of the pan. It should pull back until pan is just filled with dough. Set aside for 20 to 30 minutes while you make the sauce.", " Heat olive oil in a large saucepan over medium heat until shimmering. Add garlic, oregano, and red pepper flakes and cook, stirring, until softened and aromatic, about 1 minute. Add tomatoes. Using a pastry cutter or a potato masher, break up tomatoes into fine chunks. Stir in sugar. Bring to a bare simmer and allow to cook for about 15 minutes to let flavors meld. Season to taste with salt. Set aside and allow to cool slightly.", "Thirty minutes before baking, adjust oven rack to lower position and preheat oven to 550°F.", " Spread slices of mozzarella cheese evenly over surface of pizza. Spoon sauce on top of cheese and spread with the back of a spoon. (You will not need all the sauce; use as much as you like, but be sparing.) Spread pepperoni slices evenly over surface. Sprinkle with half of Romano cheese. Transfer to oven and bake until pepperoni is crisp and curled and bottom of pizza is golden brown when you peek by lifting the corner with a thin spatula, about 10 minutes. With some ovens, you may need to loosely tent the top of the pizza with aluminum foil and continue baking until the bottom is golden and crisp.", "Remove pizza from oven. Sprinkle with remaining half of Romano cheese, use a pizza wheel to cut it into slices, and serve immediately."], "ingredients": ["17.5 ounces bread flour (500g; about 3 1/2 cups)", "1/2 ounce salt (14g; about 1 tablespoon)", "1/4 ounce instant or rapid-rise yeast (6g; about 1 1/2 teaspoons)", "0.35 ounce extra-virgin olive oil (20g; 2 tablespoons), plus 1/4 cup olive oil (60ml; 40g) for the pan", "11.5 ounces room-temperature water (325g; about 1 cup plus 7 tablespoons)", "2 tablespoons (30ml) extra-virgin olive oil", "9 medium cloves garlic, roughly chopped", "1 tablespoon (about 4g) dried oregano", "2 teaspoons (about 3g) dried red pepper flakes, or more to taste", "1 (28-ounce; 800g) can whole peeled tomatoes", "1 teaspoon (about 4g) sugar", "Kosher salt", "1 pound (450g) sliced deli-style mozzarella cheese", "12 ounces (325g) natural-casing pepperoni, cut into 1/8-inch slices (see note above)", "4 ounces (115g) ground Pecorino Romano cheese"], "total_time": "About 4 hours (or 16 to 28 hours if using no-knead hand method)", "yiel": "Makes one 13- by 18-inch square pie, serving 6 to 8", "url": "http://www.seriouseats.com/recipes/2016/05/spicy-spring-sicilian-pizza-recipe.html"}, {"title": "Cochinita Pibil (Yucatán-Style Barbecued Pork) Recipe | Serious Eats", "active_time": "1 hour", "instructions": ["Thread garlic cloves onto a metal skewer and grill directly over the flame of a gas grill until completely blackened on all sides, 3 to 4 minutes. Alternatively, toss them in a dry skillet over high heat until blackened. Peel the blackened skins when cool enough to handle.", "\n", "Heat oil or lard in a skillet over medium heat until shimmering. Add achiote, oregano, cloves, cinnamon, black peppercorns, cumin, and allspice and cook, tossing and stirring, until fragrant, about 2 minutes. Transfer to a blender along with peeled garlic, bitter-orange juice, vinegar, soy sauce, and a big pinch of salt. Blend until smooth. Season to taste with more salt. It should be quite salty and have a consistency like ketchup. If too thick, thin it with water until it flows slowly.", "Pour marinade over meat and rub it in with your hands. Cover, refrigerate, and let it rest at least 1 hour and up to overnight.", "Lay out 2 to 3 overlapping banana leaves on a work surface. Place 1 piece of pork in the center and layer with some of the tomatoes, bell pepper, onion, and bay leaves.", "Form a tight parcel by folding the bottom side up and the top side down, then rolling in the sides. Secure parcel with kitchen twine and transfer pork to an oven-safe baking sheet or disposable aluminum baking tray. Repeat with remaining pork and banana leaves.", " When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Alternatively, set half the burners on a gas grill to the medium-high heat setting, cover, and preheat for 10 minutes.", "Place a few large hardwood chunks on the coals (no need to soak). Place aluminum tray or baking sheet on the side opposite the fire and close lid. Smoke pork, aiming for a temperature between 250 and 300°F inside the chamber the whole time, until a metal skewer inserted into pork shows no resistance, 4 to 5 hours total. (Adjust heat by adding coals and/or adjusting the air vents.) Add extra wood chunks to the coals once per hour.", "Remove pork from grill and transfer parcels to a deep platter, shallow bowl, or rimmed tray. Unwrap banana leaves and serve immediately, shredding pork with two forks, soaking it in drippings, and stuffing it into tortillas with pickled red onions and salsa."], "ingredients": ["1 whole head garlic, separated into individual unpeeled cloves", "2 tablespoons (30ml) lard or vegetable oil", "1/4 cup achiote (annatto) seeds (1 1/2 ounces; 40g)", "2 tablespoons (about 6g) Mexican oregano", "3 whole cloves", "1 (3-inch) Ceylon cinnamon stick, or a 1.5-inch piece of cassia cinnamon (see note above)", "2 tablespoons (about 8g) whole black peppercorns", "1 tablespoon (about 4g) whole cumin seed", "1 tablespoon (about 4g) whole allspice berries", "3/4 cup (175ml) bitter (Seville) orange juice, or 1/4 cup (60ml) each lime, orange, and grapefruit juice", "1/4 cup (60ml) white vinegar", "1 tablespoon (15ml) soy sauce", "Kosher salt", "4 pounds (1.8kg) boneless pork shoulder or 6 pounds (2.7kg) bone-in pork shoulder, cut into 2-inch-thick slabs", "6 to 8 banana leaves (see note above)", "2 Roma tomatoes, sliced", "1 red or green bell pepper, sliced", "1 white onion, sliced", "12 bay leaves", "Warm corn tortillas"], "total_time": "7 hours", "yiel": "Serves 8 to 12", "url": "http://www.seriouseats.com/recipes/2016/05/cochinita-pibil-yucatan-barbecue-mexican-smoked-pork-recipe.html"}, {"title": "Poached Salmon With Dill-Yogurt Sauce Recipe | Serious Eats", "active_time": "35 minutes", "instructions": ["In a large saucepan, combine 1 quart (1L) cold water with lemon juice, leek or onion, celery, fennel (if using), thyme and/or dill, bay leaf, and a large pinch of salt.", "Add salmon to poaching liquid. Water should cover, but if not, add enough to just cover salmon. Set over medium heat and bring poaching liquid to 170°F. Adjusting heat to maintain water temperature, cook salmon until it registers 115°F when an instant-read thermometer is inserted into the thickest part of the fish, about 20 minutes. (Cooking time may vary widely, so be sure to check temperatures to determine doneness.) Carefully transfer salmon to a plate to rest for 5 minutes. ", " In a medium bowl, stir together yogurt, shallot, dill, lemon juice, olive oil, and coriander seed. Season with salt and pepper.", "Serve salmon while warm, spooning yogurt sauce on top, or let it cool to room temperature before serving. You can also chill the salmon and yogurt sauce before serving."], "ingredients": ["Cold water", "Juice of 1 lemon (about 2 tablespoons; 30ml)", "1 medium leek or onion (about 6 ounces; 170g), halved", "1 large stalk celery (about 2 ounces; 55g), cut into large pieces", "1/2 fennel bulb, sliced (about 4 ounces; 115g) (optional)", "A few fresh sprigs thyme and/or dill", "1 bay leaf", "Kosher salt", "4 (8-ounce; 225g) pieces center-cut boneless, skinless salmon fillet", "1 cup (235ml) full-fat yogurt", "1 tablespoon minced shallot from 1 small (1-ounce; 30g) shallot", "1 tablespoon (about 10g) minced fresh dill ", "2 tablespoons (30ml) fresh juice from 1 lemon ", "2 tablespoons (30ml) extra-virgin olive oil ", "Large pinch ground coriander seed", "Kosher salt and freshly ground black pepper"], "total_time": "35 minutes", "yiel": "Serves 4", "url": "http://www.seriouseats.com/recipes/2016/05/poached-salmon-dill-yogurt-sauce-recipe.html"}]