[{"instructions": ["", "Heat oven to 400 degrees.", "Trim, scrub and peel the beets, toss with olive oil, salt and black pepper to taste. Wrap each in aluminum foil.", "Roast on a sheet pan for 45 to 90 minutes, depending on the size of the beets, until tender.", ""], "title": "Really Big Beets Recipe - NYT Cooking", "ingredients": ["6 large beets", "Extra-virgin olive oil", "Kosher salt and freshly ground black pepper to taste"], "total_time": "45 to 90 minutes", "url": "http://cooking.nytimes.com/recipes/1016979-really-big-beets", "yiel": "6 servings", "picture_url": "https://static01.nyt.com/images/2014/11/14/science/13VEGTHANXBEET/13VEGTHANXBEET-articleLarge.jpg"}, {"instructions": ["", "Make the vinaigrette: In a small bowl, whisk together garlic, ginger, lime juice, sherry vinegar and mustard. Season with salt and pepper, then whisk in olive oil.  Taste and adjust seasoning. Heat oven to 400 degrees.", "Cut the beets into ¾-inch wedges. Put them in a bowl and season with salt and pepper. Dress with 2 tablespoons of the vinaigrette and toss to coat well.  Set aside for at least 10 minutes at room temperature, or refrigerate for up to 4 hours.", "Put a skillet over medium-high heat.  Add the lardons and let them begin to brown and sizzle, then reduce heat and cook gently, stirring occasionally, for 5 minutes or so, until lardons are barely crisp and lightly browned. Remove lardons from pan with a slotted spoon and keep warm.", "Paint baguette slices lightly on both sides with olive oil and top each with a slice of goat cheese. Bake  for 10 minutes or so until bread is toasted and cheese has softened slightly. Put dandelion greens in a large shallow  bowl. Season lightly with salt and pepper and toss gently to coat.  Add up to 3 tablespoons of vinaigrette and toss to coat leaves well.  Divide dressed leaves among 6 plates.", "Garnish each plate with beets, bacon, hard-cooked eggs and goat cheese toast. Alternatively, serve family style with garnishes scattered over the top of the salad.", ""], "title": "Dandelion Salad With Beets, Bacon and Goat Cheese Toasts Recipe - NYT Cooking", "ingredients": ["2 garlic cloves, smashed to a paste with a little salt", "2 teaspoons grated ginger", "2 tablespoons lime juice", "1 tablespoon sherry vinegar", "2 tablespoons Dijon mustard", "Salt and ground black pepper", "4 tablespoons extra-virgin olive oil, more for goat cheese toasts", "6 medium beets, cooked and peeled (see note)", "6 ounces bacon, cut into 1/4-inch-thick lardons", "6 baguette slices", "6 ounces fresh goat cheese, cut into 1/2-inch rounds", "6 ounces dandelion greens, trimmed, washed and dried", "3 8-minute hard-cooked eggs, peeled, quartered and lightly seasoned"], "total_time": "Yield  6 servings", "url": "http://cooking.nytimes.com/recipes/1018110-dandelion-salad-with-beets-bacon-and-goat-cheese-toasts", "yiel": "6 servings", "picture_url": "https://static01.nyt.com/images/2016/05/18/dining/18KITCH1-WEB/18KITCH1-WEB-articleLarge.jpg"}, {"instructions": ["", "Heat oven to 400. Put the beets into a high-sided baking pan, so that they fit together relatively snugly. Cut off the top of the head of garlic and place it, cut side up, in one corner of the pan. Mix together 1 cup oil and the butter and drizzle it over the beets and garlic. Cover the tray tightly with aluminum foil and roast for approximately 1 hour, or until the beets are soft when pierced with a knife and the garlic is soft and caramelized.", "Remove the beets and garlic from the oven and allow to sit until the beets are cool enough to handle, approximately 10 to 15 minutes. Lift them out of the oil, peel and discard the skin and place them in a medium bowl with a pinch of salt and 1 tablespoon of the cooking oil from the baking pan. Mix well and set aside.", "Squeeze the garlic cloves out of their skin and into a small bowl. Roughly mash with the back of a fork before adding the yogurt, saffron threads and water, the lemon juice, orange zest and a pinch of salt. Stir well and place in the refrigerator until needed.", "Place a medium-size sauté pan over medium heat with the remaining 1 tablespoon of olive oil. When it shimmers, add the almonds and sauté for 1 to 2 minutes, stirring and tossing frequently, until they begin to turn golden. Add the red pepper flakes and the orange juice and continue to cook until the liquid has evaporated, approximately 30 seconds. Spoon the nuts onto a wide plate and set aside to cool.", "When you are ready to serve, spoon the yogurt onto a large serving plate and spread it out slightly. Top with the beets, making sure that you can still see yogurt at the edges. Sprinkle the almonds over the top, then the basil, and serve.", ""], "title": "Caramelized Beets with Orange-Saffron Yogurt Recipe - NYT Cooking", "ingredients": ["2 ½ pounds small beets, ideally of varying colors, skin-on, scrubbed and trimmed", "1 head of garlic", "1 cup plus 1 tablespoon extra-virgin olive oil", "7 tablespoons unsalted butter, melted", "Kosher salt to taste", "1 ¼ cups Greek yogurt", "1 pinch saffron threads soaked in 1 tablespoon boiling water", "2 teaspoons lemon juice", "Zest of ½ medium-size orange, approximately ½ teaspoon, plus 1 tablespoon orange juice", "⅓ cup slivered almonds", "¼ teaspoon red pepper flakes", "2 tablespoons basil leaves, shredded"], "total_time": "1 hour, 30 minutes", "url": "http://cooking.nytimes.com/recipes/1018135-caramelized-beets-with-orange-saffron-yogurt", "yiel": "Serves 6-8", "picture_url": "https://static01.nyt.com/images/2016/05/20/dining/beets-yotam/beets-yotam-articleLarge.jpg"}, {"instructions": ["", "Make the horseradish crema: Peel horseradish with a vegetable peeler and coarsely grate. Combine grated horseradish with sour cream, Dijon, chives and dill in a medium bowl and mix well. Season crema with lemon juice and salt to taste. (Crema can be made in advance; chill until you are ready to serve.)", "Heat grill to medium-high heat if you are using gas; if you have a charcoal grill, you want a nice hot bed of coals.", "Coat fish well with olive oil and season with salt. Set fish on the grill skin side down and cook, covered, until the flesh of the fish begins to turn opaque and the skin is crisp, 3 to 5 minutes. Use a grill spatula to carefully flip the fish and finish cooking to medium, about 2 minutes more.", "Spread horseradish crema on a serving platter or individual plates and place cooked fish on top with the skin side up. Garnish with dill and lemon wedges. Serve extra crema on the side.", ""], "title": "Grilled Arctic Char With Horseradish Crema Recipe - NYT Cooking", "ingredients": ["2 ounces fresh horseradish, peeled and coarsely grated (about 2/3 cup)", "1 ½ cups sour cream", "1 tablespoon Dijon mustard", "2 tablespoons finely chopped chives", "2 tablespoons chopped fresh dill, plus more for garnish", "2 to 3 tablespoons freshly squeezed lemon juice, plus wedges for garnish", "Salt", "4 (6-ounce) arctic char fillets (or use salmon)", "Olive oil"], "total_time": "30 minutes", "url": "http://cooking.nytimes.com/recipes/1018127-grilled-arctic-char-with-horseradish-crema", "yiel": "4 servings", "picture_url": "https://static01.nyt.com/images/2016/05/25/dining/25CHEF6/25CHEF6-articleLarge.jpg"}, {"instructions": ["", "Put olive oil in a saucepan over medium-high heat. Add half the diced onion and cook, stirring, until softened and barely colored, about 5 minutes. Season generously with salt and pepper, then add garlic, saffron and red pepper and cook for 1 minute more.", "Add squid bodies and tentacles, stir well to coat and season with salt. Add tomato, bay leaf and 1/4 cup white wine. Add 1 cup water and reduce heat to a simmer. Cook for 10 minutes, then stir in squid ink. Simmer for 10 minutes more, until squid is tender. Taste and adjust seasoning. Set aside.", "Melt butter in a heavy-bottomed saucepan over medium heat. Add remaining onion, season with salt and cook until softened, about 5 minutes. Add rice, stir to coat, and cook for 2 minutes more.", "Keeping heat brisk, add remaining 1/4 cup wine and 2 cups of the broth and simmer, stirring, until most of the liquid has been absorbed. Add another cup broth and cook for 5 minutes, stirring. Add the last cup of broth and all of the squid mixture. Cook, stirring, for 5 to 7 minutes more, until rice is just done. Taste and adjust seasoning.", "Add a little more broth, as necessary, to keep rice moist and loose, but not too soupy. Stir in lemon zest and parsley, then spoon into warm shallow soup bowls. Drizzle with a little olive oil and serve immediately.", ""], "title": "Risotto Nero with Squid Recipe - NYT Cooking", "ingredients": ["2 tablespoons extra-virgin olive oil, plus more for drizzling", "1 large onion, finely diced (about 2 cups)", "Salt and black pepper", "3 garlic cloves, minced", "Pinch of saffron", "Pinch of crushed red pepper or cayenne", "1 pound squid, bodies cleaned and cut into 1/8-inch slices, tentacles halved", "½ cup chopped tomato, canned or fresh", "1 bay leaf", "½ cup dry white wine", "2 teaspoons squid ink (sometimes sold as cuttlefish ink)", "2 tablespoons unsalted butter", "1 cup Carnaroli or Arborio rice", "4 cups unsalted fish, chicken or vegetable broth, plus more as needed", "1 teaspoon lemon zest", "2 tablespoons roughly chopped flat-leaf parsley"], "total_time": "45 minutes", "url": "http://cooking.nytimes.com/recipes/1018044-risotto-nero-with-squid", "yiel": "4 to 6 servings", "picture_url": "https://static01.nyt.com/images/2016/04/06/dining/06KITCHEN1/06KITCHEN1-articleLarge.jpg"}, {"instructions": ["", "Put each chicken breast between 2 sheets of heavy plastic and pound them to a thickness of about 1/4 inch. Trim any ragged edges. Season each breast on both sides with salt and pepper. If desired, place breasts in a bowl and cover with buttermilk and refrigerate for 1 hour (or up to 6 hours).", "Prepare the breading: Arrange 3 shallow bowls. Add flour to one bowl, then season it with salt and pepper and a little cayenne. In another bowl, beat the eggs. Fill the third bowl with bread crumbs.", "Drain the chicken. Dip each breast lightly into the seasoned flour, then into beaten egg and finally into the crumbs. Put breaded chicken on a baking sheet and sprinkle with more crumbs on both sides. Refrigerate, uncovered, until ready to fry.", "Make the olive-celery relish: In a mixing bowl, combine olives, celery, garlic, orange zest, lemon zest, red pepper, oregano, lemon juice, parsley, mint and basil. Season with salt and pepper and stir in 2 tablespoons olive oil.", "Put a cast-iron pan over medium-high heat and add olive oil to a depth of 1 inch. Heat oil to 365 degrees. Test the temperature by throwing a bread crumb into the oil — it should brown gently. Add breaded chicken breasts in one layer without crowding. Do not disturb them until they become golden and crisp on one side, about 3 minutes. Carefully turn with tongs and cook on the other side for 3 minutes more. Remove and drain breasts on absorbent paper. Give them a light sprinkling of salt.", "To serve, put 1 breast on each of 4 dinner plates. Top with 2 tablespoons green olive-celery relish and garnish with watercress and lemon wedges.", ""], "title": "Chicken Breast Milanese With Green Olive-Celery Relish Recipe - NYT Cooking", "ingredients": ["4 skinless, boneless chicken breasts, about 6 ounces each", "Salt and pepper", "2 cups buttermilk (optional)", "1 cup all-purpose flour", "Pinch of cayenne", "2 eggs", "2 cups fresh bread crumbs, from a French or Italian loaf", "1 cup roughly chopped pitted green olives (use a food processor if you have one)", "1 cup diced celery", "2 small garlic cloves, minced", "1 teaspoon orange zest", "1 teaspoon lemon zest", "¼ teaspoon crushed red pepper", "Pinch of oregano", "2 tablespoons lemon juice", "1 tablespoon chopped fresh parsley", "1 tablespoon chopped fresh mint", "1 tablespoon chopped fresh basil", "Extra-virgin olive oil", "Watercress or arugula, for garnish", "Lemon wedges, for garnish"], "total_time": "Yield  4 servings", "url": "http://cooking.nytimes.com/recipes/1018039-chicken-breast-milanese-with-green-olive-celery-relish", "yiel": "4 servings", "picture_url": "https://static01.nyt.com/images/2016/03/30/dining/30KITCHEN1/30KITCHEN1-articleLarge.jpg"}, {"instructions": ["", "Prepare the brine: In a large pot combine 8 cups water, the salt and the sugar and bring to a simmer over high heat, stirring to help dissolve the salt and sugar. Remove from heat and add garlic, leek, thyme, sage and shallots; let cool to room temperature.", "Place the chicken in a deep container large enough to hold it and the brine. Pour the cooled brine over the chicken. Pour in the 3 bottles of beer until the chicken is submerged; cover and refrigerate overnight.", "Prepare the chicken and vegetables: Heat oven to 350 degrees. Combine the brussels sprouts, potatoes, onions, chopped sage and lemon zest in a large bowl. Drizzle with oil and season with salt and pepper; toss to evenly coat.", "Remove the chicken from the brine and pat the skin dry with paper towels. Place about half of the vegetables in the bottom of a roasting pan or large sauté pan and set the chicken on top. Rub the butter evenly over the top of the chicken to coat. Pour the bottle of beer into the pan and arrange the sage sprigs in the pan around the chicken.", "Roast the chicken for 1 hour, basting every 20 minutes with the liquid in the pan.", "Increase the oven temperature to 400 degrees. Spread the remaining vegetables on a baking sheet and place on a low rack or the bottom of the oven. Cook until the chicken skin is golden brown and crisp and the vegetables are just tender and slightly charred, 20 to 30 more minutes, stirring the vegetables and basting the chicken once halfway through.", "Let the chicken rest for 10 minutes before carving. Plate chicken with a mix of roasted veggies and the vegetables from the pan. Spoon the reduced cooking liquid from the pan over the top.", ""], "title": "Beer-Brined Roast Chicken Recipe - NYT Cooking", "ingredients": ["1 cup kosher salt", "⅔ cup packed light brown sugar", "4 cloves garlic, lightly crushed", "1 leek (white and light green part), quartered", "5 sprigs thyme", "7 sprigs sage", "2 shallots, halved and peeled", "3 (12-ounce) bottles lager-style beer", "1 whole chicken (4 to 4 1/2 pounds)", "1 ½ pounds Brussels sprouts, trimmed and cut in half lengthwise", "1 ½ pounds fingerling potatoes (or other small potato), cut in half lengthwise", "2 cups whole peeled pearl onions", "2 tablespoons chopped fresh sage", "1 teaspoon freshly grated lemon zest", "3 tablespoons vegetable oil", "Salt and freshly ground black pepper", "3 to 4 sprigs sage", "3 tablespoons butter, softened", "1 (12-ounce) bottle lager-style beer"], "total_time": "Yield  4 to 6 servings", "url": "http://cooking.nytimes.com/recipes/1018059-beer-brined-roast-chicken", "yiel": "4 to 6 servings", "picture_url": ""}, {"instructions": ["", "Heat oven to 400 degrees. In a large bowl, combine ricotta, ricotta salata, pecorino Romano, eggs, herbs and  pepper.", "Brush Bundt pan with some of the melted butter. Drape 2 sheets of phyllo on top of Bundt pan, poke a hole into phyllo where center tube is and push phyllo into pan to line it. Do this with 2 more sheets placed perpendicular to the first 2 sheets. Continue adding phyllo sheets in this crisscross manner until all sheets are used. Edges of phyllo should hang over edges of pan.", "Scrape half of the ricotta filling into pan. Scatter prosciutto over ricotta, then top with mozzarella.  Spoon the rest of the ricotta mixture on top. Fold edges of phyllo over filling. Using a sharp knife, poke at least 20 holes in dough that reach all the way to bottom of pan. Slowly pour melted butter over torte; some butter will seep through holes and some will remain on top of dough.", "Place pan on a baking sheet and bake for about 1 hour 30 minutes, or until torte is puffy and golden brown. Allow torte to cool in pan for 1 to 2 hours before inverting onto a wire rack and slicing. Serve warm.", ""], "title": "Phyllo Ricotta Torte With Spring Herbs Recipe - NYT Cooking", "ingredients": ["1 ½ pounds/680 grams/3 1/4 cups fresh whole-milk ricotta", "½ cup/45 grams shredded ricotta salata", "¼ cup/28 grams pecorino Romano", "3 large eggs", "1 cup chopped soft spring herbs or baby greens (any combination of dill, mint, sorrel, chives, dandelion, parsley, arugula)", "1 teaspoon ground black pepper", "¾ cup/1 1/2 sticks/170 grams unsalted butter, melted", "1 1-pound box phyllo dough, thawed overnight in refrigerator", "½ cup/70 grams diced prosciutto", "½ cup/62 grams cubed mozzarella"], "total_time": "Yield  12 servings", "url": "http://cooking.nytimes.com/recipes/1018113-phyllo-ricotta-torte-with-spring-herbs", "yiel": "12 servings", "picture_url": ""}, {"instructions": ["", "In a small bowl, combine salt, pepper, chile powder and lemon zest. Rub the chicken inside and out with salt mixture. Place chicken on a rack set over a baking pan to catch any drips, and refrigerate for at least 4 hours or overnight.", "Heat a gas grill, or light a charcoal grill for indirect heat (meaning pile the coals on one side of the gill, leaving the other side empty).", "Place a cast-iron skillet on the grate directly over the coals. Cover the grill, and let the pan heat up for 10 minutes.", "Remove chicken from the refrigerator. Use a sharp knife to cut the skin connecting the legs to the rest of the body. Use your hands to splay the thighs open until you feel the joint pop.", "Rub chicken with oil and place it breast side down in the hot skillet. Cover grill and cook 5 to 7 minutes, until the breast is seared and golden and easily releases from the pan.", "Using tongs and a spatula for balance, carefully flip chicken and cover the grill again. Continue cooking until the underside of the chicken is starting to brown, 10 to 20 minutes. Make sure the skin doesn’t get too dark; it will continue to brown even as it cooks over indirect heat. You’re looking for a medium golden color here, a shade or two lighter than what you ultimately want it to look like.", "Move the skillet over to the unlit side of the charcoal grill, or turn off the burners on your gas grill that are underneath the pan. Cover grill and continue to cook until the bird is cooked through, 10 to 25 minutes longer. An instant-read thermometer should register 155 degrees in the breast. You’ll need to keep your eye on the grill heat as you cook. If you’ve got a thermometer on your grill cover, you’re looking for it to be at about 450 degrees. If it falls below 400 degrees or seems as if it’s not hot enough (i.e., your chicken is cooking too slowly), add more coals or turn up your burners. Use your intuition here.", "Transfer chicken from the skillet to a cutting board, and tent with foil to rest.", "Throw garlic, anchovies (if desired) and red pepper flakes into the skillet and cook, uncovered, until the garlic starts to sizzle and turn golden, about 20 seconds. Toss in spinach and dill and cook, stirring with your tongs, until just wilted, 2 minutes longer. If the spinach isn't wilting quickly, push the pan back over the flame to direct heat. Season with salt.", "Place bread slices on grill and cook until lightly charred, about 1 minute per side.", "To serve, drizzle toasts with oil and slather with ricotta. Top with spinach mix and a little lemon juice. Serve alongside sliced chicken.", ""], "title": "Grilled Roast Chicken With Spinach-Ricotta Crostini Recipe - NYT Cooking", "ingredients": ["2 teaspoons kosher salt, more as needed", "½ teaspoon black pepper", "¼ teaspoon high-quality chile powder (ancho or New Mexican are nice)", "Finely grated zest of 1 lemon (save the zested lemon to juice over the crostini)", "1 whole chicken (3 1/2 to 4 pounds), patted dry", "Extra-virgin olive oil, as needed", "2 garlic cloves, thinly sliced", "2 anchovies (optional)", "Pinch red pepper flakes", "1 pound mature spinach leaves, cleaned (12 cups)", "1 cup chopped dill", "4 slices crusty country-style bread, 1/2-inch thick", "Fresh ricotta, for serving"], "total_time": "Yield  4 servings", "url": "http://cooking.nytimes.com/recipes/1018118-grilled-roast-chicken-with-spinach-ricotta-crostini", "yiel": "4 servings", "picture_url": ""}, {"instructions": ["", "Build a medium-high fire on a clean gas or charcoal grill. (If the grill isn't clean, the salmon will stick to the grate.)", "Season the salmon with salt and pepper, lightly oil the grate of the grill, then place the fillets skin-side up over the fire and cook for about 2 to 3 minutes, until lightly browned.", "Gently flip the salmon over and cook 3 to 4 minutes more for medium rare. You can cook a little longer if you'd like, but take care not to overcook.", ""], "title": "Simplest Grilled Salmon Recipe - NYT Cooking", "ingredients": ["4 (6- to 8-ounce) salmon fillets", "Salt and pepper", "Olive oil"], "total_time": "10", "url": "http://cooking.nytimes.com/recipes/1018148-simplest-grilled-salmon", "yiel": "4 servings", "picture_url": ""}, {"instructions": ["", "Put a heavy-bottomed soup pot over medium-high heat and add 2 tablespoons coconut oil. When oil is hot, add onions and cook, stirring, for about 5 minutes, or until onions are lightly browned. Add ginger, garlic, turmeric, coriander and cayenne and cook for one minute more, or just until fragrant. Season generously with salt.", "Add carrots and 8 cups water. Raise the heat and bring to a brisk simmer, then put on the lid and turn heat to low. Cook until the carrots are tender, about 15 minutes. Remove from stove and let cool slightly. Purée in a blender in batches, then strain and return to soup pot. Thin with water if necessary; the soup should not be too thick. Set aside.", "While soup is cooking, simmer daikon in a few inches of salted water until tender, about 5 to 6 minutes. Drain and keep warm.", "Reheat the soup over medium heat, stirring occasionally. Meanwhile, heat remaining tablespoon of coconut oil in a small pan over medium-high heat. When hot, add mustard seeds, cumin seeds and serrano pepper. Cook for one minute, or until spices are fragrant and beginning to pop. Pour the entire contents of the pan into the soup and stir to combine. Taste for salt and adjust.", "Divide daikon pieces among 4 to 6 warmed bowls and ladle over a cup or so of soup. Garnish with cilantro leaves, if using, and give each bowl a squeeze of lime.", ""], "title": "Spiced Carrot Soup With Lime Recipe - NYT Cooking", "ingredients": ["3 tablespoons coconut oil, vegetable oil or ghee", "2 medium onions, thinly sliced (about 3 cups)", "1 tablespoon chopped ginger", "2 teaspoons minced garlic", "1 tablespoon turmeric", "½ teaspoon toasted and ground coriander", "⅛ teaspoon cayenne", "Salt", "2 pounds young carrots, peeled and cut into 1-inch pieces", "1 small daikon radish, peeled, halved lengthwise and sliced 1/4 inch thick (about 2 cups)", "1 teaspoon mustard seeds", "1 teaspoon cumin seeds", "1 serrano pepper, finely chopped", "Cilantro leaves, for garnish (optional)", "Lime wedges, for serving"], "total_time": "40 minutes", "url": "http://cooking.nytimes.com/recipes/1018160-spiced-carrot-soup-with-lime", "yiel": "4 to 6 servings", "picture_url": "https://static01.nyt.com/images/2016/06/08/dining/08KITCHEN1-WEB/08KITCHEN1-WEB-articleLarge.jpg"}, {"instructions": ["", "Make the braai spice: In a grinder or mortar and pestle, grind all the seasonings and herbs until fine.", "Rub steaks with the braai spice and set aside in refrigerator for 1 to 4 hours. Bring to room temperature before grilling.", "Heat a grill until screaming hot. Place steaks on the grill and cook, turning every 2 minutes or so, until crusty outside and medium-rare inside, 120 to 125 degrees. Let rest 10 minutes and slice across the grain for serving.", ""], "title": "Braai-Spiced T-Bone Steaks Recipe - NYT Cooking", "ingredients": ["4 tablespoons coarse salt", "2 tablespoons white or brown sugar (optional)", "2 tablespoons coriander seeds", "1 tablespoon black peppercorns", "1 tablespoon paprika or 2 teaspoons paprika plus 1 teaspoon cayenne", "1 tablespoon garlic flakes or powder", "1 tablespoon onion powder", "1 tablespoon dried thyme", "4 to 6 T-bone steaks, about 1 1/2 inches thick"], "total_time": "Yield  4 to 8 servings", "url": "http://cooking.nytimes.com/recipes/1018131-braai-spiced-t-bone-steaks", "yiel": "4 to 8 servings", "picture_url": "https://static01.nyt.com/images/2016/05/25/dining/25AFRICA-GRILLED-T-BONE-STEAK/25AFRICA-GRILLED-T-BONE-STEAK-articleLarge.jpg"}, {"instructions": ["", "Heat oven to 500 degrees.", "In a medium bowl, combine honey, cayenne, lime zest, ginger, garlic, salt and pepper. Toss in shrimp to coat.", "Spread shrimp on a large rimmed baking sheet and dot with butter. Roast until shrimp is pink and opaque, but before the edges have started to curl, about 5 minutes. Sprinkle generously with fresh lime juice and toss with jalapeños and chives or scallions. Serve with mayonnaise if you like.", ""], "title": "Hot Honey Shrimp Recipe - NYT Cooking", "ingredients": ["1 tablespoon honey", "⅛ teaspoon cayenne", "¼ teaspoon grated lime zest", "¼ teaspoon freshly grated ginger", "1 garlic clove, grated on a Microplane or finely minced", "¼ teaspoon kosher salt", "¼ teaspoon ground black pepper", "1 pound cleaned extra-large shrimp, patted very dry with paper towels", "1 tablespoon very cold butter, cubed", "Lime wedges, for serving", "1 jalapeño, halved, seeded and very thinly sliced, for serving", "1 tablespoon chives or scallion greens, finely chopped, for serving", "Mayonnaise, for serving (optional)"], "total_time": "10 minutes", "url": "http://cooking.nytimes.com/recipes/1018182-hot-honey-shrimp", "yiel": "2 servings", "picture_url": ""}, {"instructions": ["", "Season cavities and outside of fish with salt and pepper. Rub skin all over with coconut oil.", "Thinly slice 1 lime and 1 shallot. Cut another lime into wedges and save for garnish. Fill each fish cavity with lime and shallot slices, a handful of cilantro stems (discard the rest) and the lemongrass.", "Prepare the sauce: Coarsely chop the remaining shallot and juice the remaining lime. In a mini food processor, combine shallot, 1 tablespoon lime juice, the cilantro leaves, the mint, the chile, the garlic, the fish sauce and 1/4 teaspoon salt. Pulse until herbs are chopped, then add coconut milk and oil. Continue to pulse until a coarse, chunky sauce forms. (Don’t overdo it; you want a relish-like texture, not a purée.) Taste and add more salt, fish sauce and/or lime juice if necessary. (Alternatively, chop everything really finely by hand and stir in the coconut milk and lime juice.) Sauce can be prepared up to 4 hours ahead. Refrigerate until needed.", "Light or heat the grill to medium-high heat. Place fish in basket and grill until blistered and just cooked through, 3 to 4 minutes per side. (Poke the fish along the spine; it should be tender but still juicy.) Serve, garnished with lime wedges and mint leaves, with sauce on the side.", ""], "title": "Grilled Whole Fish With Lemongrass, Chiles and Coconut Recipe - NYT Cooking", "ingredients": ["4 (1-pound) whole dorade, branzino or trout, cleaned", "¼ teaspoon fine sea salt, more as needed", "Black pepper, as needed", "1 ½ tablespoons coconut oil, softened or melted", "3 limes", "2 small shallots, peeled", "1 bunch cilantro, leaves and stems separated (about 2 cups leaves)", "2 small stalks lemongrass, halved lengthwise and cut into 3-inch pieces", "1 cup mint leaves, more for garnish", "1 Thai chile or 1 to 2 serrano chiles, seeded and coarsely chopped", "2 small garlic cloves, grated on a Microplane or minced", "¼ teaspoon Asian fish sauce, more to taste", "½ cup unsweetened coconut milk", "1 tablespoon safflower or grapeseed oil"], "total_time": "30 minutes", "url": "http://cooking.nytimes.com/recipes/1018158-grilled-whole-fish-with-lemongrass-chiles-and-coconut", "yiel": "4 servings", "picture_url": ""}, {"instructions": ["", "Marinate the chicken: Combine all marinade ingredients in a blender or food processor and pulse into a coarse paste. Wash chicken and pat dry, then prick the thick part of the breast, legs and thighs with a sharp fork. Rub cavity and skin with paste; put chicken in a resealable bag and let rest about 10 hours or overnight.", "Poach the chicken: Combine all the poaching seasonings with 3 quarts water and bring to a boil in a 5-quart heavy pot. Add chicken, breast side down, and reduce heat to a simmer. Cook, covered, 15 minutes. Turn off heat and let chicken stand, covered, for 30 minutes. Turn chicken over, cover it again and let stand another 15 minutes. Remove chicken from pot and let it drain. Allow to cool slightly.", "Heat oven to 400 degrees. Steep tea leaves in hot, but not boiling water (about 180 degrees) about 3 minutes. Drain, reserving wet leaves. Stuff chicken with half the leaves and the remaining ingredients. Coat chicken with remaining leaves. Discard tea.", "Loosely wrap chicken with a large piece of foil and set it on a baking sheet. Poke 4 to 5 small holes in foil to allow steam to escape and liquid to drain.", "Bake chicken 30 minutes on the middle rack, then remove from oven, discard foil and drain any liquid. Return chicken to baking pan, breast side up, and bake until dark brown, 45 minutes to an hour. Cool slightly, then gently pull chicken meat in coarse strips. Discard skin, bones and stuffing. Serve chicken warm or cool with some of tea leaves.", ""], "title": "San Hua Kao Ji, Three-Flower Roast Chicken Recipe - NYT Cooking", "ingredients": ["2 tablespoons kosher salt", "2 tablespoons Chinese rice wine, like liao jiu or Shaoxing", "1 tablespoon plus 1 teaspoon red Sichuan peppercorns", "1 tablespoon good-quality jasmine tea leaves", "1 teaspoon black pepper", "½ cup coarsely chopped scallion", "1 tablespoon coarsely chopped peeled fresh ginger", "1 3- to 3 1/2-pound whole chicken", "½ cup kosher salt", "5 dried whole red chile peppers, about 3 inches long", "3 tablespoons good-quality jasmine tea leaves", "3 whole scallions, coarsely chopped", "3 1/4-inch-thick slices ginger", "2 whole star anise", "6 bay leaves", "¼ cup good-quality jasmine tea leaves", "2 whole scallions", "2 1/4-inch-thick slices ginger", "1 whole star anise", "2 bay leaves"], "total_time": "Yield  6 to 8 servings", "url": "http://cooking.nytimes.com/recipes/1018178-san-hua-kao-ji-three-flower-roast-chicken", "yiel": "6 to 8 servings", "picture_url": "https://static01.nyt.com/images/2016/06/15/dining/15JPSICHUAN4/15JPSICHUAN4-articleLarge.jpg"}]